#將資料夾裡的txt檔案relabel
#!!只能relabel一次 因為新的numbers也會被改動!!

import os
dst_db='E:\\魚類標記\\尚未加入train\\P3_0800'

def relabel(file, label_map):
    txt=None
    with open(file, 'r') as f:
        txt=f.read().split('\n')[:-1]
    
    for i in range(len(txt)):
        cls_id, s=txt[i].split(' ', 1)
        try:
            cls_id=label_map[cls_id]
        except:
            cls_id=int(cls_id)
        txt[i]=f'{cls_id} {s}'
    
    with open(file, 'w') as f:
        for s in txt:
            f.write(s+'\n')

        
        
class_map={'19':0,'20':0, '21':0, '22':0,'65':0,
           '54':1,'55':1,'77':1,
           '4':2,'5':2,'6':2,'7':2 ,'8':2,'9':2,'10':2,'11':2,'12':2,'13':2,'73':2,'78':2, 
           '14':3, '15':3, '16':3,'17':3,'18':3,
           '70':4,  
           '2':5,'3':5,'23':5,'24':5,'25':5,'26':5,'27':5,'28':5,'29':5,'30':5,'31':5,'32':5,'33':5,'34':5,'35':5,'36':5,'37':5,'38':5,'39':5,
           '40':5,'41':5,'42':5,'43':5,'44':5,'45':5,'46':5,'47':5,'48':5,'49':5,'50':5,'51':5,'52':5,'53':5,'56':5,'57':5,'58':5,'59':5,'60':5,
           '61':5,'62':5,'63':5,'64':5,'66':5,'67':5,'68':5,'69':5,'71':5,'72':5,'74':5,'75':5,'76':5,'79':5,'80':5,'81':5,'82':5,'83':5,'84':5,'85':5,'86':5,
           '87':5,'88':5,'89':5,'90':5,'91':5,'92':5,
           '1':6,'0':6,
           
          }    

# 石斑:19,20,21,22,65 >> 0
# 笛鯛:54,55,77 >> 1
# 蝶魚:4~13,73,78 >> 2  
# 鸚哥魚:14~18 >> 3 
# 老鼠斑: 70 >> 4
# 非目標魚種: >> 5
# 雀鯛: >> 6 7


for fname in os.listdir(dst_db):
    file=os.path.join(dst_db, fname)  #將所有txt檔路徑存至file變數
    relabel(file, class_map)          #讓每個file檔都依照class_map 設定的變數改變